consult-mu.org
* consult-mu.el
:PROPERTIES:
:header-args:emacs-lisp: :results none :mkdirp yes :link yes :tangle ./consult-mu.el
:END:
** Header
#+begin_src emacs-lisp
;;; consult-mu.el --- Consult Mu4e asynchronously in GNU Emacs -*- lexical-binding: t -*-

;; Copyright (C) 2023 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2023
;; Version: 1.0
;; Package-Requires: ((emacs "28.0") (consult "0.34"))
;; Homepage: https://github.com/armindarvish/consult-mu
;; Keywords: convenience, matching, tools, email

;;; Commentary:

;;; Code:

#+end_src

** Requirements
#+begin_src emacs-lisp
;;; Requirements
(eval-when-compile
(require 'consult)
(require 'mu4e)
)
#+end_src

** Define Group, Customs, Vars, etc.
*** Group
#+begin_src emacs-lisp
;;; Group

(defgroup consult-mu nil
  "Options for `consult-mu'."
  :group 'convenience
  :group 'minibuffer
  :group 'consult
  :group 'mu4e
  :prefix "consult-mu-")
#+end_src

*** Custom Variables
#+begin_src emacs-lisp
;;; Customization Variables

(defcustom consult-mu-args '("mu")
  "Command line arguments to call `mu` asynchronously.
The dynamically computed arguments are appended.
Can be either a string, or a list of strings or expressions."
  :group 'consult-mu
  :type '(choice string (repeat (choice string sexp))))

(defcustom consult-mu-maxnum mu4e-search-results-limit
  "Maximum number of results

This is normally passed to \"--maxnum\" in the command line or is defined by `mu4e-search-results-limit'. By default inherits from `mu4e-search-results-limit'. "
  :group 'consult-mu
  :type '(choice (const :tag "Unlimited" -1)
                 (integer :tag "Limit"))
  )

(defcustom consult-mu-search-sort-field mu4e-search-sort-field
  "What field to sort results by?
By defualt inherits from `mu4e-search-sort-files'."
  :group 'consult-mu
  :type '(radio (const :date)
                (const :subject)
                (const :size)
                (const :prio)
                (const :from)
                (const :to)
                (const :list)))

(defcustom consult-mu-headers-fields mu4e-headers-fields
  "A list of header fields to show in the headers buffer.

By default inherits from `mu4e-headers-field'.

From mu4e docs:

Each element has the form (HEADER . WIDTH), where HEADER is one of
the available headers (see `mu4e-header-info') and WIDTH is the
respective width in characters.

A width of nil means \"unrestricted\", and this is best reserved
for the rightmost (last) field. Note that emacs may become very
slow with excessively long lines (1000s of characters), so if you
regularly get such messages, you want to avoid fields with nil
altogether."
  :group 'consult-mu
  :type `(repeat (cons (choice ,@(mapcar (lambda (h)
                                           (list 'const :tag
                                                 (plist-get (cdr h) :help)
                                                 (car h)))
                                         mu4e-header-info))
                       (choice (integer :tag "width")
                               (const :tag "unrestricted width" nil)))))

(defcustom consult-mu-headers-template nil
  "A template string to make custom header formats.

If non-nil, consult-mu uses this string to format the headers instead of `consul-mu-headers-field'.

In the string special “%[char][integer]” chunks allow dynamic insertion of the content. each chunk represents a different field and the integer defines the length of the field. for exmaple \"%d15%s50\" means 15 characters for date and 50 charcters for subject.

The list of available files are:

  %f  sender(s) (e.g. from: field of email)
  %t  receivers(s) (i.e. to: field of email)
  %s  subject (i.e. title of email)
  %d  date (i.e. the date email was sent/received)
  %p  priority
  %z  size
  %i  message-id (as defined by mu)
  %g  flags (as defined by mu)
  %G  pretty flags (this uses `mu4e~headers-flags-str' to pretify flags)
  %x  tags (as defined by mu)
  %c  cc (i.e. cc: field of the email)
  %h  bcc (i.e. bcc: field of the email)
  %r  date chaged (as defined by :changed in mu4e)

For example, the string \"%d13%s50%f17\" would make a header containing 13 characters for date, 50 characters for subject, and 20 characters for from field, making a header that looks like this:

Thu 09 Nov 23  Title of the Email Limited to 50 Characters Onl...  example@domain...

"
  :group 'consult-mu
  :type 'string)

(defcustom consult-mu-search-sort-direction mu4e-search-sort-direction
  "Direction to sort by; a symbol.

By defualt inherits from 'mu4e-search-sort-direction'. and can either be
`descending' (sorting  Z->A)
or
`ascending' (sorting A->Z)."

  :group 'consult-mu
  :type '(radio (const ascending)
                (const descending)))


(defcustom consult-mu-search-threads mu4e-search-threads
  "Whether to calculate threads for search results.
By defualt inherits from 'mu4e-search-threads'.

Note that per mu4e docs:
When threading is enabled, the headers are exclusively sorted
chronologically (:date) by the newest message in the thread.
"
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-group-by nil
  "What field to use to group the results in the minibuffer.

By default it is set to :date. But can be any of:

  :subject      group by subject
  :from         group by the name/email the sender(s)
  :to           group by name/email of the reciver(s)
  :date         group by date
  :time         group by the time of email (i.e. hour, minute, seconds)
  :datetime     group by date and time of the email
  :year         group by the year of the email (i.e. 2023, 2022, ...)
  :month        group by the month of the email (i.e. Jan, Feb, ..., Dec)
  :week         group by the week number of the email (.i.e. 1st week, 2nd week, ... 52nd week)
  :day-of-week  group by the day email was sent (i.e. Mondays, Tuesdays, ...)
  :day          group by the day email was sent (similar to :day-of-week)
  :size         group by the file size of the email
  :flags        group by flags (as defined by mu)
  :tags         group by tags (as defined by mu)
  :changed      group by the date changed (as defined by :changed field in mu4e)
"
  :group 'consult-mu
  :type '(radio (const :date)
                (const :subject)
                (const :from)
                (const :to)
                (const :time)
                (const :datetime)
                (const :year)
                (const :month)
                (const :week)
                (const :day-of-week)
                (const :day)
                (const :size)
                (const :flags)
                (const :tags)
                (const :changed)
                (const nil)))

(defcustom consult-mu-contacts-group-by :name
  "What field to use to group the results in the minibuffer.

By default it is set to :name. But can be any of:

  :name         group by contact name
  :email        group by email of the contact
  :domain       group by the domain of the contact's email (e.g. domain.com in user@domain.com)
  :user         group by the ncontact's user name (e.g. user in user@domain.com)
"
  :group 'consult-mu
  :type '(radio (const :name)
                (const :email)
                (const :domain)
                (const :user)))

(defcustom consult-mu-mark-previewed-as-read nil
  "Whether to mark PREVIEWED emails as read or not?"
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-mark-viewed-as-read t
  "Whether to mark VIEWED emails as read or not?"
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-headers-buffer-name "*consult-mu-headers*"
  "Default name for HEADERS buffer explicitly for consult-mu.

For more info see `mu4e-headers-buffer-name'."
  :group 'consult-mu
  :type 'string)

(defcustom consult-mu-view-buffer-name "*consult-mu-view*"
  "Default name for VIEW buffer explicitly for consult-mu.

For more info see `mu4e-view-buffer-name'."
  :group 'consult-mu
  :type 'string)

(defcustom consult-mu-preview-key consult-preview-key
  "Preview key for `consult-mu'.

This is similar `consult-preview-key' but explicitly for consult-mu."
  :type '(choice (const :tag "Any key" any)
                 (list :tag "Debounced"
                       (const :debounce)
                       (float :tag "Seconds" 0.1)
                       (const any))
                 (const :tag "No preview" nil)
                 (key :tag "Key")
                 (repeat :tag "List of keys" key)))


(defcustom consult-mu-highlight-matches t
  "Should `consult-mu' highlight search queries in preview buffers?"
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-action #'consult-mu--view-action
  "The function that is used when selecting a message.
By default it is bound to `consult-mu--view-action'."
  :group 'consult-mu
  :type 'function)

(defcustom consult-mu-contacts-action #'consult-mu-contacts--list-messages-action
  "The function that is used when selecting a contact.
By default it is bound to `consult-mu-contacts--list-messages-action'."
  :group 'consult-mu
  :type 'function)

(defcustom consult-mu-default-command #'consult-mu-dynamic
  "Which command should `consult-mu' call."
  :group 'consult-mu
  :type '(choice (function :tag "Use Dynamic Collection (i.e. `consult-mu-dynamic')" #'consult-mu-dynamic)
                (function :tag "Use Async Collection (i.e. `consult-mu-async')"  #'consult-mu-async)
                (function :tag "Custom Function")))



#+end_src

*** Other Variables
#+begin_src emacs-lisp
;;; Other Variables
(defvar consult-mu-category 'consult-mu
  "Category symbol for the `consult-mu' package.")

(defvar consult-mu-messages-category 'consult-mu-messages
  "Category symbol for messages in `consult-mu' package.")

(defvar consult-mu-contacts-category 'consult-mu-contacts
  "Category symbol for contacts in `consult-mu' package.")

(defvar consult-mu--view-buffers-list (list)
  "List of currently open preview buffers for `consult-mu'.")

(defvar consult-mu--history nil
  "History variable for `consult-mu'.")

(defvar consult-mu-delimiter "      "
  "Delimiter to use for fields in mu command output.

The idea is Taken from  https://github.com/seanfarley/counsel-mu.")

(defvar consult-mu-saved-searches-dynamic (list)
  "List of Favorite searches for `consult-mu'.")

(defvar consult-mu-saved-searches-async consult-mu-saved-searches-dynamic
  "List of Favorite searches for `consult-mu'.")

(defvar consult-mu--override-group nil
"Override grouping in `consult-mu' based on user input.")

(defvar consult-mu-contacts--override-group nil
"Override grouping in `consult-mu-contacs' based on user input.")


#+end_src

** Define faces
#+begin_src emacs-lisp
;;; Faces

(defface consult-mu-highlight-match-face
  `((t :inherit 'consult-highlight-match))
  "highlight match face in `consult-mu''s view buffer.

By default inherits from `consult-highlight-match'.
This is used to highlight matches od seqrch queries in the minibufffer completion list."
  )

(defface consult-mu-preview-match-face
  `((t :inherit 'consult-preview-match))
  "highlight match face in `consult-mu''s preview buffers.
 By default inherits from `consult-preview-match'.
This is used to highlight matches of search query terms in preview buffers (i.e. `consult-mu-view-buffer-name').")

(defface consult-mu-default-face
  `((t :inherit 'default))
  "default face in `consult-mu''s minibuffer annotations.
By default inherits from `default' face.")

(defface consult-mu-subject-face
  `((t :inherit 'font-lock-keyword-face))
  "Subject face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-keyword-face'.")

(defface consult-mu-sender-face
  `((t :inherit 'font-lock-variable-name-face))
  "Contact face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-variable-name-face'.")

(defface consult-mu-receiver-face
  `((t :inherit 'font-lock-variable-name-face))
  "Contact face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-variable-name-face'.")

(defface consult-mu-date-face
  `((t :inherit 'font-lock-preprocessor-face))
  "date face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-preprocessor-face'.")

(defface consult-mu-count-face
  `((t :inherit 'font-lock-string-face))
  "Count face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-string-face'.")

(defface consult-mu-size-face
  `((t :inherit 'font-lock-string-face))
  "Size face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-string-face'.")

(defface consult-mu-tags-face
  `((t :inherit 'font-lock-comment-face))
  "tags/comments face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-comment-face'.")

(defface consult-mu-flags-face
  `((t :inherit 'font-lock-function-call-face))
  "flags face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-function-call-face'.")

(defface consult-mu-url-face
  `((t :inherit 'link))
  "url face in `consult-mu''s minibuffer annotations;
By default inherits from `link'.")

#+end_src

** Backend functions
This section includes functions (utilities, mu4e hacks, ...).
*** general utility
**** formatting strings
***** fix string length
#+begin_src emacs-lisp
(defun consult-mu--set-string-width (string width &optional prepend)
  "Sets the STRING width to a fixed value, WIDTH.
If the STRING is longer than WIDTH, it truncates the string and adds ellipsis, \"...\". If the string is shorter it adds whitespace to the string.
If PREPEND is non-nil, it truncates or adds whitespace from the beginning of string, instead of the end."
  (let* ((string (format "%s" string))
         (w (string-width string)))
    (when (< w width)
      (if prepend
          (setq string (format "%s%s" (make-string (- width w) ?\s) (substring string)))
        (setq string (format "%s%s" (substring string) (make-string (- width w) ?\s)))))
    (when (> w width)
      (if prepend
          (setq string (format "...%s" (substring string (- w (- width 3)) w)))
        (setq string (format "%s..." (substring string 0 (- width (+ w 3)))))))
    string))

(defun consult-mu--justify-left (string prefix maxwidth)
  "Sets the width of  STRING+PREFIX justified from left.
It uses `consult-mu--set-string-width' and sets the width of the concatenate of STRING+PREFIX (e.g. `(concat prefix string)`) within MAXWIDTH. This is used for aligning marginalia info in minibuffer when using `consult-mu'."
  (let ((s (string-width string))
        (w (string-width prefix)))
    (if (> maxwidth w)
    (consult-mu--set-string-width string (- maxwidth w) t)
    string
          )
    ))

#+end_src
***** highlight match with text-properties
#+begin_src emacs-lisp
(defun consult-mu--highlight-match (regexp str ignore-case)
  "Highlights REGEXP in STR.
If a regular expression contains capturing groups, only these are highlighted.
If no capturing groups are used highlight the whole match.  Case is ignored
if IGNORE-CASE is non-nil.
(This is adapted from `consult--highlight-regexps'.)"
  (let ((i 0))
    (while (and (let ((case-fold-search ignore-case))
                  (string-match regexp str i))
                (> (match-end 0) i))
      (let ((m (match-data)))
        (setq i (cadr m)
              m (or (cddr m) m))
        (while m
          (when (car m)
            (add-face-text-property (car m) (cadr m)
                                     'consult-mu-highlight-match-face nil str)
            )
          (setq m (cddr m))))))
  str)
#+end_src
